Back-end/app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1
---
  def index
    @notes = Note.where(user_id: current_user).reverse

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @notes = Note.find(params[:id])

INSERT INTO "notes" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This note"], ["content", "You got me!"], ["user_id", 1], ["created_at", "2016-05-04 02:42:52.385510"], ["updated_at", "2016-05-04 02:42:52.385510"]]
---
  def create
    @note = current_user.notes.build(note_params)

    if @note.save

UPDATE "notes" SET "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["content", "Code, Code and Code and Read!"], ["updated_at", "2016-05-04 00:23:39.722423"], ["id", 4]]
---
  def update
    if @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 3]]
---
  def destroy
    @note.destroy

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 4]]
---
  def find_note
    @note = Note.find(params[:id])